backend/modules/voyagemanagement/controllers/ActiveConfigController.php

SELECT count(*) count FROM `v_c_active`
---
	public function actionActive_config()
	{
		if(isset($_GET['active_id'])){
			$active_id = $_GET['active_id'];
			VCActive::deleteAll(['active_id'=>$active_id]);
			VCActiveI18n::deleteAll(['active_id'=>$active_id]);
			Helper::show_message('Delete successful ', Url::toRoute(['active_config']));
		}

		if(isset($_POST['ids'])){
			$ids = implode(',', $_POST['ids']);

			VCActive::deleteAll("active_id in ($ids)");
			VCActiveI18n::deleteAll("active_id in ($ids)");

			Helper::show_message('Delete successful ', Url::toRoute(['active_config']));
		}

		$query  = new Query();
		$query->select(['v_c_active.*','v_c_active_i18n.name','v_c_active_i18n.i18n'])
				->from('v_c_active')
				->join('LEFT JOIN','v_c_active_i18n','v_c_active.active_id=v_c_active_i18n.active_id')
				->where(['v_c_active_i18n.i18n'=>'en'])
				->limit(2)
				->all();
		$actives = $query->createCommand()->queryAll();

		$count = VCActive::find()->count();

SELECT count(*) count FROM `v_c_active_detail` WHERE active_id='1'
---
	public function actionActive_config_edit()
	{
		//获取编辑页面的信息
		$active_id = isset($_GET['active_id']) ? $_GET['active_id'] : '';

		$query  = new Query();
		$query->select(['a.active_id','a.status','b.name'])
		->from('v_c_active a')
		->join('LEFT JOIN','v_c_active_i18n b','a.active_id=b.active_id')
		->where(['a.active_id'=>$active_id,'b.i18n'=>'en'])
		->one();
		$active = $query->createCommand()->queryOne();
		$count = VCActiveDetail::find()->where(['active_id'=>$active_id])->count();