backend/modules/voyagemanagement/controllers/DefaultController.php

SELECT COUNT(*) FROM `v_c_cabin_type`
---
    public function actionCabin_type(){
    	if(isset($_GET['code'])){
    		$code = isset($_GET['code'])?$_GET['code']:'';
    		$sql = "DELETE FROM `v_c_cabin_type` WHERE type_code = '{$code}'";
    		Yii::$app->db->createCommand($sql)->execute();
    		$sql = "DELETE FROM `v_c_cabin_type_i18n` WHERE type_code = '{$code}'";
    		Yii::$app->db->createCommand($sql)->execute();
    		return $this->redirect(['cabin_type']);
    	}
    	if($_POST){
    		$ids = implode('\',\'', $_POST['ids']);
    		$sql = "DELETE FROM `v_c_cabin_type` WHERE type_code in ('$ids')";
    		Yii::$app->db->createCommand($sql)->execute();
    		$sql = "DELETE FROM `v_c_cabin_type_i18n` WHERE type_code in ('$ids')";
    		Yii::$app->db->createCommand($sql)->execute();
    		return $this->redirect(['cabin_type']);
    	}

    	$count = VCCabinType::find()->count();

SELECT COUNT(*) FROM `v_c_shore_excursion`
---
    public function actionShore_excursion(){
    	if(isset($_GET['code'])){
    		$code = isset($_GET['code'])?$_GET['code']:'';
    		$sql = "DELETE FROM `v_c_shore_excursion` WHERE se_code = '{$code}'";
    		Yii::$app->db->createCommand($sql)->execute();
    		$sql = "DELETE FROM `v_c_shore_excursion_i18n` WHERE se_code = '{$code}'";
    		Yii::$app->db->createCommand($sql)->execute();
    		return $this->redirect(['shore_excursion']);
    	}
    	if($_POST){
    		$ids = implode('\',\'', $_POST['ids']);
    		$sql = "DELETE FROM `v_c_shore_excursion` WHERE se_code in ('$ids')";
    		Yii::$app->db->createCommand($sql)->execute();
    		$sql = "DELETE FROM `v_c_shore_excursion_i18n` WHERE se_code in ('$ids')";
    		Yii::$app->db->createCommand($sql)->execute();
    		return $this->redirect(['shore_excursion']);
    	}

    	$count = VCShoreExcursion::find()->count();

INSERT INTO `v_c_shore_excursion` (`se_code`, `status`) VALUES ('bbv', 1)
INSERT INTO `v_c_shore_excursion_i18n` (`se_code`, `se_name`, `se_info`, `i18n`) VALUES ('bbv', 'rg', 'dgrg', 'en')
---
    public function actionShore_excursion_add(){
    	$db = Yii::$app->db;
    	$shore_excursion = new VCShoreExcursion();
    	$shore_excursion_language = new VCShoreExcursionI18n();
    	if($_POST){
    		$code = isset($_POST['code'])?addslashes($_POST['code']):'';
    		$state = isset($_POST['state'])?$_POST['state']:'0';
    		$name = isset($_POST['name'])?addslashes($_POST['name']):'';
    		$desc = isset($_POST['desc'])?addslashes(trim($_POST['desc'])):'';

    		$shore_excursion->se_code = $code;
    		$shore_excursion->status = $state;

    		$shore_excursion_language->se_code = $code;
    		$shore_excursion_language->se_name = $name;
    		$shore_excursion_language->se_info = $desc;
    		$shore_excursion_language->i18n = 'en';

    		//事务处理
    		$transaction=$db->beginTransaction();
    		try{
    			$shore_excursion->save();
    			$shore_excursion_language->save();

SELECT count(*) count FROM `v_c_shore_excursion` WHERE se_code='vr' AND id!=2
---
    public function actionShore_excursion_code_check(){
    	$code = isset($_GET['code'])?$_GET['code']:'';
    	$act = isset($_GET['act'])?$_GET['act']:2;
    	$id = isset($_GET['id'])?$_GET['id']:'';
    	if($act == 1){
    		//edit
    		$sql = "SELECT count(*) count FROM `v_c_shore_excursion` WHERE se_code='$code' AND id!=$id";
    		$result = Yii::$app->db->createCommand($sql)->queryOne();
    		$count = $result['count'];
    	}else{
    		//add
    		$count = VCShoreExcursion::find()->where(['se_code' => $code])->count();