travelagent/controllers/BookingtickeController.php

SELECT `a`.`voyage_code`, `a`.`ticket_price`, `a`.`start_time`, `a`.`end_time`, `b`.`voyage_name`, `b`.`i18n` FROM `v_c_voyage` `a` LEFT JOIN `v_c_voyage_i18n` `b` ON a.voyage_code=b.voyage_code WHERE `b`.`i18n`='en' LIMIT 2
SELECT COUNT(*) FROM `v_c_voyage` `a` LEFT JOIN `v_c_voyage_i18n` `b` ON a.voyage_code=b.voyage_code WHERE `b`.`i18n`='en'
---
	public function actionBooking_ticke(){

		$query  = new Query();
		$result = $query->select(['a.voyage_code','a.ticket_price','a.start_time','a.end_time','b.voyage_name','b.i18n'])
		->from('v_c_voyage a')
		->join('LEFT JOIN','v_c_voyage_i18n b','a.voyage_code=b.voyage_code')
		->where(['b.i18n'=>'en'])
		->limit(2)
		->all();

		$query  = new Query();
		$count = $query->select(['*'])
		->from('v_c_voyage a')
		->join('LEFT JOIN','v_c_voyage_i18n b','a.voyage_code=b.voyage_code')
		->where(['b.i18n'=>'en'])
		->count();